In [11]:
import pandas as pd
df = pd.read_json("archhoefe.json")
df['globalname'] = df['name'] + "." + df['line_name']
df['get_measuritems'] = "SELECT * FROM dbo.location WHERE globalname = '" + df['globalname'] + "';"
df['update_alias'] = "UPDATE dbo.location SET aliasname = '" + df['line_name'] + "' WHERE globalname = '" + df['globalname'] + "';"

df.to_csv("archhoefe-w-commands.csv")
df.head(20)

,name,line_name,globalname,get_measuritems,update_alias
0,arch09_01,linie01_person,arch09_01.linie01_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie01_p...
1,arch09_02,linie03_person,arch09_02.linie03_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie03_p...
2,arch09_02,linie02_person,arch09_02.linie02_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie02_p...
3,arch09_02,linie01_person,arch09_02.linie01_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie01_p...
4,arch05_01,linie03_person,arch05_01.linie03_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie03_p...
5,arch05_01,linie04_person,arch05_01.linie04_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie04_p...
6,arch06_01,linie03_person,arch06_01.linie03_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie03_p...
7,arch04_01,linie01_person,arch04_01.linie01_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie01_p...
8,arch04_01,linie02_person,arch04_01.linie02_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie02_p...
9,arch10_01,linie03_person,arch10_01.linie03_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie03_p...
10,arch10_01,linie02_person,arch10_01.linie02_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie02_p...
11,arch06_02,linie01_person,arch06_02.linie01_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie01_p...
12,arch06_02,linie03_person,arch06_02.linie03_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie03_p...
13,arch06_02,linie02_person,arch06_02.linie02_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie02_p...
14,arch04_02,linie02_person,arch04_02.linie02_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie02_p...
15,arch08_01,linie03_person,arch08_01.linie03_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie03_p...
16,arch08_02,linie02_person,arch08_02.linie02_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie02_p...
17,arch02_02,linie02_person,arch02_02.linie02_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie02_p...
18,arch07_02,linie03_person,arch07_02.linie03_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie03_p...
19,arch10_02,linie02_person,arch10_02.linie02_person,SELECT * FROM dbo.location WHERE globalname = ...,UPDATE dbo.location SET aliasname = 'linie02_p...